Revit 2027 API
BuiltInFailures.RebarShapeFailures.CurveUnderconstrained Property
 Segment is underconstrained. It requires additional parameterized dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveUnderconstrained { get; }
Public Shared ReadOnly Property CurveUnderconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveUnderconstrained {
	FailureDefinitionId^ get ();
}
static member CurveUnderconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace